In [26]:
import pandas as pd

In [27]:
exam_result = {
               'Name':['Sandy','Meraj','Aniket','Amar','Raj', 'Pallavi'],
               'Score': [45,30,78,66,33,68],
               'no_of_attempts':[2,4,2,1,2,3],
               'qualify':['YES', 'YES', 'NO', 'YES','NO','YES']
              }

In [28]:
df = pd.DataFrame(data = exam_result)

In [30]:
#Set alphabetics index
df['Index'] = ['a','b','c','d','e','f']
df.set_index('Index')

          Name  Score  no_of_attempts qualify
Index
a        Sandy     45               2     YES
b        Meraj     30               4     YES
c       Aniket     78               2      NO
d         Amar     66               1     YES
e          Raj     33               2      NO
f      Pallavi     68               3     YES

In [32]:
#print the first 4 rows of the data frame
df[:4].set_index('Index')

         Name  Score  no_of_attempts qualify
Index
a       Sandy     45               2     YES
b       Meraj     30               4     YES
c      Aniket     78               2      NO
d        Amar     66               1     YES

In [33]:
#print name and qualify from this data frame
df[['Name','qualify']]

      Name qualify
0    Sandy     YES
1    Meraj     YES
2   Aniket      NO
3     Amar     YES
4      Raj      NO
5  Pallavi     YES

In [35]:
#print number of score in between 20 - 35 and also print the sum of attempts by each students
r1 = df['Score'] >= 20
r2 = df['Score'] <= 35
df[r1 & r2]

    Name  Score  no_of_attempts qualify Index
1  Meraj     30               4     YES     b
4    Raj     33               2      NO     e